Revit 2026 API

# SplitButtonCurrentButton Property

---

Gets or sets the current PushButton of the SplitButton.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PushButton CurrentButton { get; set; }
```
```vb
Public Property CurrentButton As PushButton
	Get
	Set
```
```cpp
public:
property PushButton^ CurrentButton {
	PushButton^ get ();
	void set (PushButton^ value);
}
```
```fsharp
member CurrentButton : PushButton with get, set
```

#### Property Value

PushButton

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when trying to set the CurrentButton to . |
| ArgumentException | Thrown when trying to set the CurrentButton to a button which is not in current drop-down list. |
| InvalidOperationException | Thrown when trying to set the CurrentButton if IsSynchronizedWithCurrentItem is false. |

This property is applicable only if IsSynchronizedWithCurrentItem is true. The default value of this property will be the first enabled PushButton in the drop down list after the SplitButton is shown.

#### Reference

SplitButton Class

Autodesk.Revit.UI Namespace